core/src/test/resources/Validation/Wsdl/IgnoreImport/in-ok.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<MessageHeader xmlns="http://nn.nl/XSD/Generic/MessageHeader/1">
			<From>
				<Id>Ibis4Baco</Id>
			</From>
			<To>
				<Location>ESB.PensionsSMB.TS.ValueTransfer.ValueTransferLegacy.1.StartIncomingValueTransferProcess.1.Action</Location>
			</To>
			<HeaderFields>
				<CPAId>n/a</CPAId>
				<ConversationId>bert.simsom.biz_0ace08b7-6f54774c_151440bf444_7ebd</ConversationId>
				<MessageId>bert.simsom.biz_0ace08b7-6f54774c_151440bf444_7ebe</MessageId>
				<Timestamp>2015-11-27T14:21:35</Timestamp>
			</HeaderFields>
			<Service>
				<Name>ValueTransfer</Name>
				<Context>ValueTransferLegacy</Context>
				<Action>
					<Paradigm>Action</Paradigm>
					<Name>StartIncomingValueTransferProcess</Name>
					<Version>1</Version>
				</Action>
			</Service>
		</MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<StartIncomingValueTransferRequest xmlns="http://nn.nl/XSD/PensionsSMB/ValueTransfer/ValueTransferLegacy/1/StartIncomingValueTransferProcess/1">
			<OldEmployername>PreviousEmployer</OldEmployername>
			<RequestDate>2015-11-27</RequestDate>
			<EmployeeData>
				<PersonalDemographics>
					<BSN>128487331</BSN>
					<Birthdate>1970-06-15</Birthdate>
					<Gender>1</Gender>
					<Initials>WAA</Initials>
					<LastName>Testpersoon 22</LastName>
				</PersonalDemographics>
				<EmployeeAddressData>
					<Street>Street</Street>
					<HouseNumber>1</HouseNumber>
					<HouseNumberAddition>a</HouseNumberAddition>
					<PostalCode>1231</PostalCode>
					<City>City</City>
					<CountryCode>BE</CountryCode>
					<CountryName>België</CountryName>
				</EmployeeAddressData>
				<PensionParticipation>
					<VTA-id>1</VTA-id>
					<PlanNr>1</PlanNr>
					<ContractNr>91001</ContractNr>
				</PensionParticipation>
				<PensionParticipation>
					<VTA-id>3</VTA-id>
					<ContractNr>91003</ContractNr>
				</PensionParticipation>
				<PensionParticipation>
					<VTA-id>2</VTA-id>
					<ContractNr>91004</ContractNr>
				</PensionParticipation>
				<FormerPUO>
					<BP-id>0500611066</BP-id>
				</FormerPUO>
			</EmployeeData>
			<EmploymentData>
				<StartDate>1999-06-01</StartDate>
			</EmploymentData>
		</StartIncomingValueTransferRequest>
	</soapenv:Body>
</soapenv:Envelope>
